data_generation/simulation_results/case_8/constant/simParams
nIter 2000;
hComponent0 2893.9605726698883;
hComponent1 2142.5479230002993;
hComponent2 3518.388622807083;
hComponent3 2192.66433424402;
hComponent4 3864.7239889495318;kComponent0 84.8663106152985;
kComponent1 59.51654467882982;
kComponent2 72.0176972652804;
kComponent3 41.87841746083667;
kComponent4 50.85960242678573;
tAmbient 300;
Ux 1.771020006450854;
kPCB 0.8701577202654692;